       IDENTIFICATION DIVISION.                             
       PROGRAM-ID. MEM18.                                   
       ENVIRONMENT DIVISION.                                
       DATA DIVISION.                                       
       WORKING-STORAGE SECTION.                             
       01 B.                                                
        03 A PIC 99 VALUE 10 OCCURS 10 TIMES.               
       PROCEDURE DIVISION.                                  
           DISPLAY A(1).                                    
           DISPLAY A(3).                                    
           DISPLAY A(5).                                    
           STOP RUN.                                        